load-test-v1-3-nav-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  jmeter:
    memory-xmx: 2G
    cmdline: --loglevel DEBUG
    gui: false
    path: ~/.bzt/jmeter-taurus/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
    version: 5.4.2  # minimal supported version of JMeter is 5.0
    force-ctg: true   # true by default
    detect-plugins: true
    fix-jars: true
    plugins:
    - jpgc-json=2.2
    - jmeter-ftp
    - jpgc-casutg
    plugins-manager:
      download-link: https://search.maven.org/remotecontent?filepath=kg/apc/jmeter-plugins-manager/{version}/jmeter-plugins-manager-{version}.jar
      version: 1.3   # minimum 0.16
    command-runner:
      download-link: https://search.maven.org/remotecontent?filepath=kg/apc/cmdrunner/{version}/cmdrunner-{version}.jar
      version: 2.2   # minimum 2.0
    properties:
      log_level.jmeter: WARN
      log_level.jmeter.threads: DEBUG
      jmeter.reportgenerator.apdex_satisfied_threshold: 1000
      jmeter.reportgenerator.report_title: JMeter Taurus Demo
      jmeter.reportgenerator.overall_granularity: 1000
      jmeter.reportgenerator.exporter.html.series_filter: ^(ClickNext|HP|scenario)(-success|-failure)?$
      output: ${TAURUS_ARTIFACTS_DIR}/output/
    system-properties:
      sun.net.http.allowRestrictedHeaders: "true"

execution:
- executor: selenium
  scenario: load-test-v1-nav-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 60s

- executor: jmeter
  scenario: load-test-v1-nav-Http

  concurrency: 2  # all tests will be split into 2 processes - number of target concurrent virtual users
  ramp-up: 30s  # time to reach target concurrency
  hold-for: 59s  #  time to hold target concurrency
  #iterations: 100  # - limit scenario iterations number

scenarios:
  load-test-v1-nav-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 10s
    think-time: 0s
    requests:
    - label: 1-Home
      actions:
      - resizeWindow(2560,1279)
      - go(https://lb.demo.deptdxp.com/)
      - waitForByCSS(a[href='/strapi-blog'], visible)
      - waitForByCss(a[href='/kontent.ai'], visible)
      - waitForByCss(a[href='/store'], visible)
      - waitForByXpath(//a[normalize-space()='Contentful'], visible)
      - waitForByXPath(//a[normalize-space()='Search'], present)

    - label: 2-Strapi
      actions:
      - clickByLinkText(Strapi)
      - waitForByXpath(//h1[contains(text(),'Blog')], present)
      - waitForByXpath(//section/div[2]//img, present)
      - pauseFor(1)

    - label: 3-Kontent.ai
      actions:
      - waitForByCss(a[href='/kontent.ai'], visible)
      - clickByLinkText(Kontent.ai)
      - waitForByXpath(//h1[contains(text(),'Blog')], present)
      - waitForByXpath(//section/div[2]//img, present)
      - pauseFor(1)

    - label: 4-Store
      actions:
      - waitForByCss(a[href='/store'], visible)
      - clickByLinkText(Store)
      - waitForByXpath(//section/button, visible)
      - waitForByXpath(//section//ol/li, visible)
      - waitForByXpath(//section/div/h2, visible)
      - pauseFor(1)

    - label: 5-Contentful
      actions:    
      - pauseFor(1)
      - waitForByCss(a[href='/contentful'], visible)
      - clickByLinkText(Contentful)
      - waitForByXpath(//section/div[2]//h2, visible)
      - waitForByXpath(//section/div[3]//img, visible)
      - waitForByXpath(//section/div[3]//h1, visible)
      - pauseFor(1)
      asserts:
      - contains:
        - 'Welcome'

    - label: 6-Search
      actions:
      - pauseFor(1)
      - waitForByCss(a[href='/contentful/search'], visible)
      - clickByLinkText(Search)
      - pauseFor(3)
      - waitForByXpath(//section//form/input, visible)
      - waitForByXpath(//section//ul, visible)
      - waitForByXpath(//section//div[2]//ol/li, visible)
      assert:
      - contains:
        - 'Search'

  load-test-v1-nav-Http:
    script: test/JMX/BZT Generated Test Plan.jmx
  reporting:
  - module: console
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    failed-labels: false  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-csv: TaurusResult/perf_result_csv.csv
  - module: junit-xml
    data-source: pass-fail
    filename: TaurusResult/junit-result.xml